{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Yolo_v4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "convn_0", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_0", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_0", "inbound_nodes": [[["convn_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_0", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_0", "inbound_nodes": [[["BN_0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zerop_1", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zerop_1", "inbound_nodes": [[["mish_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_1", "inbound_nodes": [[["zerop_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_1", "inbound_nodes": [[["convn_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_1", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_1", "inbound_nodes": [[["BN_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_4", "inbound_nodes": [[["mish_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_4", "inbound_nodes": [[["convn_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_4", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_4", "inbound_nodes": [[["BN_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_5", "inbound_nodes": [[["mish_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_5", "inbound_nodes": [[["convn_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_5", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_5", "inbound_nodes": [[["BN_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_6", "inbound_nodes": [[["mish_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_6", "inbound_nodes": [[["convn_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_6", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_6", "inbound_nodes": [[["BN_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["mish_4", 0, 0, {}], ["mish_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_8", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_2", "inbound_nodes": [[["mish_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_8", "inbound_nodes": [[["convn_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_2", "inbound_nodes": [[["convn_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_8", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_8", "inbound_nodes": [[["BN_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_2", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_2", "inbound_nodes": [[["BN_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat_9", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concat_9", "inbound_nodes": [[["mish_8", 0, 0, {}], ["mish_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_10", "inbound_nodes": [[["concat_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_10", "inbound_nodes": [[["convn_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_10", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_10", "inbound_nodes": [[["BN_10", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zerop_11", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zerop_11", "inbound_nodes": [[["mish_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_11", "inbound_nodes": [[["zerop_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_11", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_11", "inbound_nodes": [[["convn_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_11", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_11", "inbound_nodes": [[["BN_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_14", "inbound_nodes": [[["mish_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_14", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_14", "inbound_nodes": [[["convn_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_14", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_14", "inbound_nodes": [[["BN_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_15", "inbound_nodes": [[["mish_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_15", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_15", "inbound_nodes": [[["convn_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_15", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_15", "inbound_nodes": [[["BN_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_16", "inbound_nodes": [[["mish_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_16", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_16", "inbound_nodes": [[["convn_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_16", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_16", "inbound_nodes": [[["BN_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "name": "add_17", "inbound_nodes": [[["mish_14", 0, 0, {}], ["mish_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_18", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_18", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_18", "inbound_nodes": [[["convn_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_18", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_18", "inbound_nodes": [[["BN_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_19", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_19", "inbound_nodes": [[["mish_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_19", "inbound_nodes": [[["convn_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_19", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_19", "inbound_nodes": [[["BN_19", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "name": "add_20", "inbound_nodes": [[["add_17", 0, 0, {}], ["mish_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_21", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_21", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_12", "inbound_nodes": [[["mish_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_21", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_21", "inbound_nodes": [[["convn_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_12", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_12", "inbound_nodes": [[["convn_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_21", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_21", "inbound_nodes": [[["BN_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_12", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_12", "inbound_nodes": [[["BN_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat_22", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concat_22", "inbound_nodes": [[["mish_21", 0, 0, {}], ["mish_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_23", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_23", "inbound_nodes": [[["concat_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_23", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_23", "inbound_nodes": [[["convn_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_23", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_23", "inbound_nodes": [[["BN_23", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zerop_24", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zerop_24", "inbound_nodes": [[["mish_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_24", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_24", "inbound_nodes": [[["zerop_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_24", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_24", "inbound_nodes": [[["convn_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_24", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_24", "inbound_nodes": [[["BN_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_27", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_27", "inbound_nodes": [[["mish_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_27", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_27", "inbound_nodes": [[["convn_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_27", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_27", "inbound_nodes": [[["BN_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_28", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_28", "inbound_nodes": [[["mish_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_28", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_28", "inbound_nodes": [[["convn_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_28", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_28", "inbound_nodes": [[["BN_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_29", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_29", "inbound_nodes": [[["mish_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_29", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_29", "inbound_nodes": [[["convn_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_29", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_29", "inbound_nodes": [[["BN_29", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["mish_27", 0, 0, {}], ["mish_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_31", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_31", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_31", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_31", "inbound_nodes": [[["convn_31", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_31", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_31", "inbound_nodes": [[["BN_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_32", "inbound_nodes": [[["mish_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_32", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_32", "inbound_nodes": [[["convn_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_32", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_32", "inbound_nodes": [[["BN_32", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["add_30", 0, 0, {}], ["mish_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_34", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_34", "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_34", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_34", "inbound_nodes": [[["convn_34", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_34", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_34", "inbound_nodes": [[["BN_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_35", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_35", "inbound_nodes": [[["mish_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_35", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_35", "inbound_nodes": [[["convn_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_35", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_35", "inbound_nodes": [[["BN_35", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "name": "add_36", "inbound_nodes": [[["add_33", 0, 0, {}], ["mish_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_37", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_37", "inbound_nodes": [[["add_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_37", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_37", "inbound_nodes": [[["convn_37", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_37", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_37", "inbound_nodes": [[["BN_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_38", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_38", "inbound_nodes": [[["mish_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_38", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_38", "inbound_nodes": [[["convn_38", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_38", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_38", "inbound_nodes": [[["BN_38", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "name": "add_39", "inbound_nodes": [[["add_36", 0, 0, {}], ["mish_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_40", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_40", "inbound_nodes": [[["add_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_40", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_40", "inbound_nodes": [[["convn_40", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_40", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_40", "inbound_nodes": [[["BN_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_41", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_41", "inbound_nodes": [[["mish_40", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_41", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_41", "inbound_nodes": [[["convn_41", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_41", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_41", "inbound_nodes": [[["BN_41", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_42", "trainable": true, "dtype": "float32"}, "name": "add_42", "inbound_nodes": [[["add_39", 0, 0, {}], ["mish_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_43", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_43", "inbound_nodes": [[["add_42", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_43", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BN_43", "inbound_nodes": [[["convn_43", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "mish_43", "trainable": true, "dtype": "float32", "activation": {"class_name": "Mish", "config": {"name": "mish", "trainable": true, "dtype": "float32", "activation": "mish"}, "shared_object_id": 9}}, "name": "mish_43", "inbound_nodes": [[["BN_43", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "convn_44", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convn_44", "inbound_nodes": [[["mish_43", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BN_44", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": 